#include <head.h>

struct ZACHETKA *writeZ(void)
{
	static struct ZACHETKA Z =
	{
		"Дмитрий",
		"Багажков",
		"Игоревич",
		"1БИК17666",
		{
			{ 2017,
			  1,
				{
					{ "Информатика", "Загвоздкина", "11.01.18", { notDiff, {.acc = 1} }  },
					{ "История России", "Гусев", "23.12.17", { notDiff, {.acc = 1} }  },
					{ "Русский язык и культура речи", "Терешкова", "10.01.18", { notDiff, {.acc = 1} }  },
					{ "Введение в специальность", "Гончаров", "19.12.17", { notDiff, {.acc = 1} }  },
					{ "Английский язык", "Толкачева", "11.01.18", { notDiff, {.acc = 1} }  }
				},
				{
					{ "Аналитическая геометрия и линейная алгебра", "Пискарев", "23.01.18", { Diff, {.mark = Good} }  },
					{ "Высшая математика", "Лакерник", "20.01.18", { Diff, {.mark = Norm} }  },
					{ "Философия", "Плужникова", "30.01.18", { Diff, {.mark = Excel} }  }
				}
			},
			{ 2018,
			  2,
				{
					{ "Эффективность Инвестиций и Инноваций", "Кузовков", "29.05.18", { notDiff, {.acc = 1} }  },
					{ "Теоретические Основы Экономики", "Тришалова", "13.06.18", { notDiff, {.acc = 1} }  },
					{ "Физическая Культура", "Симкачева", "09.06.18", { notDiff, {.acc = 1} }  },
					{ "Физика", "Тренин", "07.06.18", { notDiff, {.acc = 1} }  },
					{ "Компьютерная Графика", "Пискарева", "11.06.18", { notDiff, {.acc = 1} }  }
				},
				{
					{ "История", "Полянская", "18.06.18", { Diff, {.mark = Excel} }  },
					{ "Информатика", "Юскова", "25.06.18", { Diff, {.mark = Excel} }  },
					{ "Высшая Математика", "Лакерник", "21.06.18", { Diff, {.mark = Good} }  },
					{ "Иностранный язык", "Кожевникова", "02.07.18", { Diff, {.mark = Excel} }  }
				}
			},
			{ 2018,
			  3,
				{
					{ "Физические Основы Электроники", "Власов", "09.01.19", { notDiff, {.acc = 1} }  },
					{ "ИРСиСРиР", "Коринский", "22.12.18", { notDiff, {.acc = 1} }  },
					{ "Вычислительные Математические Пакетные Пакеты Пакетов", "Юсков", "29.12.18", { notDiff, {.acc = 1} }  },
					{ "Теория Электрических Цепей", "Григорьва", "10.01.19", { notDiff, {.acc = 1} }  },
					{ "Теория Электрических Цепей Курсовая работа", "Григорьва", "10.01.19", { Diff,{.mark = Excel} }  },
					{ "Теория Функций Комплексного Переменного", "Надежина", "09.01.19", { notDiff, {.acc = 1} }  }
				},
				{
					{ "Дискретная Математика", "Лакерник", "16.01.19", { Diff, {.mark = Excel} }  },
					{ "Вычислительные Модели", "Юсков", "31.01.18", { Diff, {.mark = Excel} }  },
					{ "Физика", "Тренин", "25.01.19", { Diff, {.mark = Excel} }  },
					{ "Теория Вероятности и Математическая Статистика", "Смирнова", "21.01.19", { Diff, {.mark = Norm} }  }
				}
			},
			{ 2019,
			  4,
				{
					{ "Анализ Случайных Процессов", "Маненков", "07.06.19", { notDiff, {.acc = 1} }  },
					{ "Экология", "Эколог", "21.05.19", { notDiff, {.acc = 1} }  },
					{ "Вычислительные Модели Курсовая работа", "Гловацкая", "12.03.19", { Diff, {.mark = Excel} }  },
					{ "Математическое Описание Теории Электромагнитных Полей", "Ястребцова", "12.04.19", { notDiff, {.acc = 1} }  },
					{ "Электромагнитные Поля и Волны", "Ястребцова", "12.04.19", { notDiff, {.acc = 1} }  },
					{ "Физическая Культура", "Несмертный", "07.06.19", { notDiff, {.acc = 1} }  },
					{ "Безопасные Практические Занятия", "Барков", "11.06.19", { notDiff, {.acc = 1} }  }
				},
				{
					{ "Электроника", "Власов", "04.07.19", { Diff, {.mark = Excel} }  },
					{ "Теория Электрических Цепей", "Григорьева", "26.06.19", { Diff, {.mark = Excel} }  },
					{ "Общая Теория Связи", "Осипов", "17.06.19", { Diff, {.mark = Norm} }  },
					{ "Схемотехника Телекоммуникационных Устройств", "Долин", "23.06.13", { Diff, {.mark = Excel} }  }
				}
			},
		}
	};
	return &Z;
}

void stroka(struct ZACHETKA *Z, int n)
{
	if (*Z->semI[n].prack[0].name)
	{
		printf("Результаты промежуточной аттестации (экзамены):\n\n%-65s %-10s %-10s %-60s\n\n", "Наименование дисциплины", "Оценка", "Дата", "Фамилия преподавателя");
		for (int i = 0; *Z->semI[n].prack[i].name; i++)
		{
			printf("%-65s %-10d %-10s %-60s\n", Z->semI[n].prack[i].name, Z->semI[n].prack[i].str.value.mark, Z->semI[n].prack[i].time, Z->semI[n].prack[i].teacher);
		}
	}
	else
	{
		printf("Данные об экзаменах отсутствуют\n");
	}
	printf("\n");
	if (*Z->semI[n].theor[0].name)
	{
		printf("Результаты промежуточной аттестации (зачеты):\n\n%-65s %-10s %-10s %-60s\n\n", "Наименование дисциплины", "Оценка", "Дата", "Фамилия преподавателя");
		for (int i = 0; *Z->semI[n].theor[i].name; i++)
		{
			if (Z->semI[n].theor[i].str.type == notDiff)
			{
				printf("%-65s %-10s %-10s %-60s\n", Z->semI[n].theor[i].name, Z->semI[n].theor[i].str.value.acc ? "Зачтено" : "Не зачтено", Z->semI[n].theor[i].time, Z->semI[n].theor[i].teacher);
			}
			else
			{
				printf("%-65s %-10d %-10s %-60s\n", Z->semI[n].theor[i].name, Z->semI[n].theor[i].str.value.mark, Z->semI[n].theor[i].time, Z->semI[n].theor[i].teacher);
			}
		}
	}
	else
	{
		printf("Данные о зачетах отсутствуют\n");
	}
}

void main(void)
{
	setlocale(LC_ALL, "Rus");
	struct ZACHETKA *Z = writeZ();
	do
	{
		printf("Номер зачетной книжки: %s\nФИО студента: %s %s %s\n", Z->number, Z->lastName, Z->firstName, Z->daddyName);
		printf("2. Выберите вариант отображения:\n1 - Семестр №1\n2 - Семестр №2\n3 - Семестр №3\n4 - Семестр №4\n5 - Все семестры\n6 - Выход\n");
		switch (_getch())
		{
		case'1':
			system("cls");
			printf("Семестр 1:\n\n");
			stroka(Z, 0);
			break;
		case'2':
			system("cls");
			printf("Семестр 2:\n\n");
			stroka(Z, 1);
			break;
		case'3':
			system("cls");
			printf("Семестр 3:\n\n");
			stroka(Z, 2);
			break;
		case'4':
			system("cls");
			printf("Семестр 4:\n\n");
			stroka(Z, 3);
			break;
		case'5':
			system("cls");
			printf("Семестр 1:\n\n");
			stroka(Z, 0);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 2:\n\n");
			stroka(Z, 1);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 3:\n\n");
			stroka(Z, 2);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 4:\n\n");
			stroka(Z, 3);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			break;
		case'6':
			exit(0);
		}
		system("pause");
		system("cls");
	} while (1);
}